# $language = "Python"
# $interface = "1.0"

# ========================================================================
# для выполнения диагностики и помещения результата в буфер обмена 
# необходимо выделить мышкой значение серийного номера, лицевого счёта 
# или ONT, например, значение "485754430068409E", "102147" или "0/ 0/0 2"
# ========================================================================
# Поддержка аргументов (использование данного скрипта для разных 
# кнопок SecureCRT с разными функциями)
#  -n: полная диагностика без перезапуска LAN-портов
#  -o: только проверка оптики (не готово)
#  -i: только проверка register-info (не готово)
#  -d: удаление терминала (не готово)
# ========================================================================
# TODO:
# - проверка массовости
# - парсинг результата ping 
# - Eсли терминал недоступен, но не известна причина недоступности, то 
#   добавить сообщение "Если на терминале индикация LOS, то согласовать 
#   выезд для проверки линии."
# - фиксация аптайма терминала
# - фиксация загрузки и температуры CPU
# - 
# ========================================================================

import os
import sys
import importlib

script_dir = os.path.dirname(
    os.path.abspath(__file__)
)

sys.path.insert(
    0,
    script_dir
)

import GPON_class

importlib.reload(
    GPON_class
)

from GPON_class import (
    Ont,
    GPON,
    inject_crt
)

inject_crt(crt)


def main():

    if not crt.Session.Connected:

        crt.Dialog.MessageBox(
            "Нет соединения"
        )

        return

    ont = Ont()

    gpon = GPON(
        ont
    )

    result = (
        gpon.diagnose()
    )

    crt.Dialog.MessageBox(
        result
    )


main()